// Задание
// Имя товара изменили на 'Ремонтный дроид' и увеличили его цену на 1500 кредитов.
// Переопредели значения переменных pricePerItem и productName после их объявления.

// Тесты
// Переменная pricePerItem объявлена с помощью let.
// При объявлении переменной pricePerItem присвоено значение число 2000.
// Переменной pricePerItem присвоено новое значение, больше чем предыдущее на 1500.
// Переменная productName объявлена с помощью let.
// При объявлении переменной productName присвоено значение - строка 'Дроид'.
// Переменной productName присвоено новое значение - строка 'Ремонтный дроид'.
// let productName = 'Дроид';
// let pricePerItem = 2000;

pricePerItem = 3500;
productName = 'Ремонтный дроид';
