// Задание
// Дополни код функции add так, чтобы она возвращала результат сложения значений трёх параметров a, b и c.

// Тесты
// Объявлена функция add(a, b, c).
// В функции add есть оператор return.
// Вызов add(15, 27, 10) возвращает 52.
// Вызов add(10, 20, 30) возвращает 60.
// Вызов add(5, 10, 15) возвращает 30.
// Вызов функции со случайными, но валидными аргументами, возвращает правильное значение.

// Решение
function add(a, b, c) {
  //  Пиши код ниже этой строки
  return a + b + c;

  //  Пиши код выше этой строки
}

add(2, 5, 8); // 15

console.log(add(15, 27, 10));
console.log(add(10, 20, 30));
console.log(add(5, 10, 15));
